// Домашнее задание 10.2 (55 баллов) / Срок сдачи задания - 19 ноября

//Задача: 
// студенты получают дополнительные баллы за успешное и самое быстрое завершение практической работы, 
// для этого нам необходимо вычислить данных студентов. 
// Дан объект с набором данных разных студентов, 
// - необходимо вычислить студента с максимальным количеством баллов 
// - в консоли вывести поздравления для данного студента.
// - добавить парамеризованные тесты 
// (объекты для проверки хранятся в данном файле 
// https://drive.google.com/file/d/1q63tCl_86YHxPJ_SGy085YimrrY-7Kw_/view?usp=sharing), 

// - измерить покрытие и покрыть тестами на 100% по веткам и строкам 
// (при необходимости добавить еще тесты и/или тестовые данные).
// в readme добавить описание работы вашего проекта, 
// его запуск и настройку для будущих коллег, 
// а также инфо относительно измерения покрытия в вашем проекте - что измеряете, как настраивать и запускать.

// Приложите ссылку на коммит в вашем удаленном репозитории.